# Basic Coding Test

1. 테스트 일시: 
2. 지원자 성명:

# 1. basic list processing 
### 1) list3의 값이 [1,2,3,1,2,3]이 되도록 list1을 이용하여 code를 작성하세요
### 2) list6을 가지고 list comprehension을 이용하여 제시된 list7, list8를 만드는 code를 작성하세요.
### 3) list7 = [0, 2, 4, 6, 8, 10, 12, 14, 16, 18] 
### 4) list8 = [0, 2, 4, 6, 8]

In [1]:
import numpy as np

list1 = [1,2,3]
list2 = [1,2,3,4,5,6]

In [4]:
list3 = list1 * 2
print (list3)

[1, 2, 3, 1, 2, 3]

In [13]:
list4 = list3 + list2
print (list4) append

[1, 2, 3, 1, 2, 3, 1, 2, 3, 4, 5, 6]

In [20]:
list5 = []
for i in range(len(list3)):
    list5.append(list2[i] + list3[i])

print (list5)

[2, 4, 6, 5, 7, 9]

# 2. list comprehension
### 1) list6을 가지고 list comprehension을 이용하여 제시된 list7, list8를 만드는 code를 작성하세요.
### 2) list7 = [0, 2, 4, 6, 8, 10, 12, 14, 16, 18] 
### 3) list8 = [0, 2, 4, 6, 8]

In [23]:
list6 = [0,1,2,3,4,5,6,7,8,9]

In [31]:
[i*2 for i in list6]

[0, 2, 4, 6, 8, 10, 12, 14, 16, 18]

In [33]:
[i for i in list6 if i%2 == 0]

[0, 2, 4, 6, 8]

# 3. set operation
### list9의 원소들중에서 list10의 원소가 아닌것들만 모아서 list11을 만들고자 한다. 
### 즉, list11 : [0, 2, 4, 6, 8] 를 만들어내는 code를 작성하세요

In [34]:
list9 = [0,1,2,3,4,5,6,7,8,9]
list10 = [1,3,5,7,9,11,13,15,17,19]

In [45]:
list11 = list(set(list9) - set(list10))
print (list11)

[0, 2, 4, 6, 8]

## 4. dataframe parameter
### col2가 홀수면 col1은 'o', 짝수면 'e'로 변경하고자 한다.
### 주어진 code를 실행해 보고 표시되는 warning/error message의 의미를 설명하고 message의 지시대로 code를 수정하세요

In [46]:
import pandas as pd 

def process_df(df_param):
    df_param[df_param.col2 % 2 == 0]['col1'] = 'e'
    df_param[df_param.col2 % 2 == 1]['col1'] = 'o'

def main():
    df = pd.DataFrame(
        [
            {'col1':'?', 'col2':1},
            {'col1':'?', 'col2':2},
            {'col1':'?', 'col2':3},
            {'col1':'?', 'col2':4},
        ]
    )
    
    display(df)
    process_df(df)
    display(df)
    
main()

  col1  col2
0    ?     1
1    ?     2
2    ?     3
3    ?     4

/home/kiho/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  after removing the cwd from sys.path.
/home/kiho/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """

  col1  col2
0    ?     1
1    ?     2
2    ?     3
3    ?     4

In [50]:
df = pd.DataFrame(
        [
            {'col1':'?', 'col2':1},
            {'col1':'?', 'col2':2},
            {'col1':'?', 'col2':3},
            {'col1':'?', 'col2':4},
        ]
    )

def process_df(x):
    if x % 2 == 0:
        return 'o'
    else:
        return 'e'
df['col1'] = df['col2'].apply(process_df)
df

  col1  col2
0    e     1
1    o     2
2    e     3
3    o     4

# 5. diff between rows
### 주어진 df의 col2를 이용하여 col2_diff를 만드는 code를 작성하세요.
### col2_diff는 col2의 앞 원소에서 뒷 원소를 뺀 값. 단 제일 첫번째 값은 0으로 채우세요.
### 4-0 = 4, 0-7 = -7, 7-2 = 5, ... 
### 즉, col2_diff = [0.0, 4.0, -7.0, 5.0, -6.0, 7.0, -1.0, -3.0, 2.0, -6.0]
### df['col2_diff'] = ?
### hint : pandas series shift와 fillna를 사용함. (주의 : for loop 사용하지 마세요.)

In [69]:
import pandas as pd
val2 = [4,0,7,2,8,1,2,5,3,9]
val1 = [chr(i) for i in range(ord('a'), ord('z')+1)][:len(val2)]
df = pd.DataFrame({'col1':val1, 'col2':val2})
display(df)

  col1  col2
0    a     4
1    b     0
2    c     7
3    d     2
4    e     8
5    f     1
6    g     2
7    h     5
8    i     3
9    j     9

In [75]:
df_01 = df.shift(periods = -1).fillna(0)
df_02 = pd.merge(df,df_01, how = 'outer',left_index = True, right_index = True)
df_02['col2_diff'] = df_02['col2_x'] - df_02['col2_y']
list(df_02['col2_diff'])

[4.0, -7.0, 5.0, -6.0, 7.0, -1.0, -3.0, 2.0, -6.0, 9.0]

# 6. vectorized str function of pandas series & type cast
### code columns (string)의 'code_' 부분을 없애고 나머지 부분을 integer로 type을 변경하여 각 integer code 값을 두배 (x 2)하는 code를 작성하세요.
### 즉, 결과를 다음과 같이 만들도록

In [76]:
dt = pd.DataFrame([{'code': 246, 'name': 'abc'},
                   {'code': 690, 'name': 'xyz'},
                   {'code': 1356, 'name': 'stw'}])
dt

   code name
0   246  abc
1   690  xyz
2  1356  stw

In [96]:
df = pd.DataFrame([
    {'code':'code_123', 'name':'abc'},
    {'code':'code_345', 'name':'xyz'},    
    {'code':'code_678', 'name':'stw'},    
])

import re
def clean_text(x):
    result = re.sub('code_','',x)
    return result
df['code'] = df['code'].apply(clean_text).astype('int')
df['code'] = df['code'] * 2
df

   code name
0   246  abc
1   690  xyz
2  1356  stw

# 7. basic datetime, timedelta and parsing/formatting datetime
### string으로 표현된 시간 str_datetime1을 datetime으로 만듭니다. 
### dt1으로부터 72시간 45분전 datetime을 구합니다. (dt2)
### dt2를 str_datetime1와 같은 형식의 string으로 변환하여 출력합니다.
### display( ... )

In [101]:
from datetime import datetime, timedelta
str_datetime1 = '2019-02-26 14:35:50'
display(str_datetime1)
dt1 = datetime.strptime(str_datetime1, "%Y-%m-%d %H:%M:%S")
display(dt1)

'2019-02-26 14:35:50'

datetime.datetime(2019, 2, 26, 14, 35, 50)

In [102]:
dt2 = dt1 + timedelta(days = 3, hours = 45)
dt2

datetime.datetime(2019, 3, 3, 11, 35, 50)

# 8. group by multiple columns & apply
### id, sub_id 의 두개 columns으로 group by 하여 val1의 합을 'sum_val1' column , val2의 곱을 'prod_val2' columns으로 하는 dataframe을 만드는 code를 작성하세요. (hint : series의 합 : .sum(), 곱 : .prod())
#### groupby와 apply 사용. lambda를 사용해도 되고 apply function을 define하여 사용해도 됨.

#### 참조 : 결과는 아래와 같이 나옵니다.

In [130]:
df = pd.DataFrame([{'id': 'a', 'sub_id': 1, 'sum_val1': 100, 'prod_val2': 10},
 {'id': 'a', 'sub_id': 2, 'sum_val1': 102, 'prod_val2': 22},
 {'id': 'a', 'sub_id': 3, 'sum_val1': 104, 'prod_val2': 36},
 {'id': 'b', 'sub_id': 1, 'sum_val1': 106, 'prod_val2': 52},
 {'id': 'b', 'sub_id': 2, 'sum_val1': 108, 'prod_val2': 70},
 {'id': 'b', 'sub_id': 3, 'sum_val1': 110, 'prod_val2': 90},
 {'id': 'c', 'sub_id': 1, 'sum_val1': 112, 'prod_val2': 112},
 {'id': 'c', 'sub_id': 2, 'sum_val1': 114, 'prod_val2': 136},
 {'id': 'c', 'sub_id': 3, 'sum_val1': 116, 'prod_val2': 162}])
df

  id  prod_val2  sub_id  sum_val1
0  a         10       1       100
1  a         22       2       102
2  a         36       3       104
3  b         52       1       106
4  b         70       2       108
5  b         90       3       110
6  c        112       1       112
7  c        136       2       114
8  c        162       3       116

In [133]:
import numpy as np

df = pd.DataFrame([
    {'id':'a', 'sub_id':1, 'val1':0, 'val2':10},
    {'id':'a', 'sub_id':1, 'val1':100, 'val2':1},
    
    {'id':'a', 'sub_id':2, 'val1':1, 'val2':11},
    {'id':'a', 'sub_id':2, 'val1':101, 'val2':2},
    
    {'id':'a', 'sub_id':3, 'val1':2, 'val2':12},
    {'id':'a', 'sub_id':3, 'val1':102, 'val2':3},
    
    {'id':'b', 'sub_id':1, 'val1':3, 'val2':13},
    {'id':'b', 'sub_id':1, 'val1':103, 'val2':4},
    
    {'id':'b', 'sub_id':2, 'val1':4, 'val2':14},
    {'id':'b', 'sub_id':2, 'val1':104, 'val2':5},
    
    {'id':'b', 'sub_id':3, 'val1':5, 'val2':15},
    {'id':'b', 'sub_id':3, 'val1':105, 'val2':6},
    
    {'id':'c', 'sub_id':1, 'val1':6, 'val2':16},
    {'id':'c', 'sub_id':1, 'val1':106, 'val2':7},
    
    {'id':'c', 'sub_id':2, 'val1':7, 'val2':17},
    {'id':'c', 'sub_id':2, 'val1':107, 'val2':8},
    
    {'id':'c', 'sub_id':3, 'val1':8, 'val2':18},
    {'id':'c', 'sub_id':3, 'val1':108, 'val2':9},
])
df

   id  sub_id  val1  val2
0   a       1     0    10
1   a       1   100     1
2   a       2     1    11
3   a       2   101     2
4   a       3     2    12
5   a       3   102     3
6   b       1     3    13
7   b       1   103     4
8   b       2     4    14
9   b       2   104     5
10  b       3     5    15
11  b       3   105     6
12  c       1     6    16
13  c       1   106     7
14  c       2     7    17
15  c       2   107     8
16  c       3     8    18
17  c       3   108     9

In [136]:
a = df.groupby(['id','sub_id'])['val1'].sum().reset_index()
b = df.groupby(['id','sub_id'])['val2'].prod().reset_index()
#b = b.rename(columns = {'sub_id':'sub_id2'})
result = pd.merge(a,b, on = ['id','sub_id'])
result = result.rename(columns = {'val1':'sum_val1'})
result = result.rename(columns = {'val2':'prod_val2'})
result = pd.DataFrame(result, columns = ['id','prod_val2','sub_id','sum_val1'])
result

  id  prod_val2  sub_id  sum_val1
0  a         10       1       100
1  a         22       2       102
2  a         36       3       104
3  b         52       1       106
4  b         70       2       108
5  b         90       3       110
6  c        112       1       112
7  c        136       2       114
8  c        162       3       116

## 9. parallel processing

In [0]:
# multi processing을 이용하여 1 ~ 100까지의 factorial의 합을 구하는 code를 작성하세요.
# factorial(1) + factorial(2) + ... + factorial(100)
# 주의 : windows notebook 환경에서는 multi-processing이 원활하지 않습니다.
# 필요하다면 .py script를 작성하여 command shell 에서 python xxx.py로 실행되도록 작성합니다.

In [140]:
import multiprocessing
import time
import math

start_time  = time.time()
i = 10**6
math.factorial(i) * (math.factorial(i) + 1) // 2
print ('%s 초' % (time.time() - start_time))

0.00015282630920410156 초

In [139]:
start_time  = time.time()
i = 10**6
math.factorial(i) * (math.factorial(i) + 1) // 2

if __name__ == '__main__':
    pool = multiprocessing.Pool(processes = 2)
    pool.close()
    pool.join()
    
print ('%s 초' % (time.time() - start_time))

0.10860419273376465 초

In [ ]:
#https://beomi.github.io/2017/07/05/HowToMakeWebCrawler-with-Multiprocess/

## 10. SQL basics

In [0]:
# RDB에 연결되었다고 가정하고, 주어진 문제에 맞도록 query의 [...] 부분을 완성하세요.
import pandas as pd
from sqlalchemy import create_engine
import pymysql
# pymysql.install_as_MySQLdb()
# rdb = 'mysql://user:password@host:port/wspider_rev?charset=utf8mb4' 
# engine = create_engine(rdb, encoding='utf8', pool_size=50, pool_recycle=3600, connect_args={'connect_timeout':1000000})

In [0]:
# Q1 - table MWS_COLT_ITEM의 전체 columns을 10개 row만 읽어오는 sql query는 ? hint : limit 
query = 'select * from MWS_COLT_ITEM [...];'
# result = pd.read_sql_query(query, engine)    
# display(result)

# Q2 - table MWS_COLT_ITEM의 BRAND_NAME columns의 unique한 값의 갯수는 몇 개인지를 읽어오는 query ? hint : count distinct
query = 'select [...] from MWS_COLT_ITEM;'

# Q3 - table MWS_COLT_ITEM_IVT에서 ITEM_ID = 100 인 rows들의 unique한 STOCK_ID 들만 표시하는 query ? hint : distinct where
query = 'select [...] from MWS_COLT_ITEM_IVT where [...];'

# Q4 - table MWS_COLT_ITEM_IVT에서 ITEM_ID = 100 이고 REG_DT가 "2019-01-25" 일 0시부터 "2019-01-26"일 0시 까지의 rows들을 읽는 query ? hint : between
query = 'select [...] from MWS_COLT_ITEM_IVT where [...];'

# Q5 -  MWS_COLT_ITEM table에서 BRAND_NAME이 "CASIO"인 제품중 ID columns이 MWS_COLT_ITEM_IVT table의 ITEM_ID columns의 값과 같은 rows들의  
#       ITEM_ID, STOCK_ID, GOODS_NAME, BRAND_NAME, REG_DT (MWS_COLT_ITEM_IVT의 REG DT), STOCK_AMOUNT columns만을 읽어오는 query ? 
query = 'select [...];'

# engine.dispose()